# Add versions
tap 'homebrew/versions'

# Add services
tap 'homebrew/services'

# Install cask with versions and fonts
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

# Install Apps
cask 'alfred'
cask 'appcleaner'
cask 'charles'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'google-hangouts'
cask 'harvest'
cask 'iterm2-beta'
cask 'java'
# cask 'karabiner'
cask 'messenger'
cask 'owasp-zap'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'whatsapp'
cask 'vagrant'
cask 'virtualbox'
cask 'tigervpn'
cask 'telegram'

# Install fonts
cask 'font-sauce-code-powerline'

# Install command line tools
brew 'ack'
brew 'awscli'
brew 'bats'
brew 'coreutils'
brew 'ctags'
brew 'editorconfig'
brew 'elasticsearch'
brew 'git'
brew 'go'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'mongodb'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'phantomjs'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby-build'
brew 'sbt'
brew 'shellcheck'
brew 'siege'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'fasd'
brew 'qt' # for capibara
brew 'vim'
brew 'jq'

# Install neovim
tap 'neovim/neovim'
brew 'neovim'
