# Add versions
# tap 'homebrew/versions'

# Add services
tap 'homebrew/services'

# Install cask with versions and fonts
tap 'caskroom/cask'
tap 'caskroom/versions'

# Install Apps
cask 'alfred'
cask 'appcleaner'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-drive-file-stream'
cask 'harvest'
cask 'iterm2'
cask 'karabiner-elements'
cask 'messenger'
cask 'owasp-zap'
cask 'skitch'
cask 'skype'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'whatsapp'
cask 'virtualbox'
cask 'telegram'
# cask 'tigervpn'
cask 'tunnelblick'
cask 'spectacle'
cask 'atom'

# Install fonts
tap 'homebrew/cask-fonts'
cask 'font-sauce-code-powerline'

# Install command line tools
brew 'ack'
brew 'awscli'
brew 'bats'
brew 'coreutils'
brew 'ctags'
brew 'editorconfig'
brew 'elasticsearch'
brew 'git'
brew 'go'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'phantomjs'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby-build'
brew 'sbt'
brew 'shellcheck'
brew 'siege'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'fasd'
brew 'qt' # for capibara
brew 'vim'
brew 'jq'
brew 'ripgrep'
brew 'diff-so-fancy'
brew 'entr' # watch files and execute a cmd

# Install neovim
# tap 'neovim/neovim'
# brew 'neovim'
